package lab2.yegorov;

/**
 * Created by AdminPC on 13.02.14.
 */

/*
1.	Написать на java класс, который реализует функционал работы с массивом, приведенный в варианте задания.
    Обязательно создать методы: введение массива, вывод массива, сортировка массива (любым методом).
2.	Создать класс для тестирования методов работы с массивом, создать минимум 10 тестов.

Variant 3.	Создать матрицу M на N, для которой подсчитать сумму элементов каждой строки.
 */

public class Lab2 {
    public static void StartTestLab2(String args[]) {
        Test.testing();
    }
}
